____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
unet_input (InputLayer)          (None, 256, 256, 3)   0                                            
____________________________________________________________________________________________________
unet_conv2D_1 (Conv2D)           (None, 128, 128, 64)  1792        unet_input[0][0]                 
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 128, 128, 64)  0           unet_conv2D_1[0][0]              
____________________________________________________________________________________________________
unet_conv2D_2 (Conv2D)           (None, 64, 64, 128)   73856       leaky_re_lu_1[0][0]              
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 64, 128)   512         unet_conv2D_2[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 64, 64, 128)   0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
unet_conv2D_3 (Conv2D)           (None, 32, 32, 256)   295168      leaky_re_lu_2[0][0]              
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 32, 32, 256)   1024        unet_conv2D_3[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 32, 32, 256)   0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
unet_conv2D_4 (Conv2D)           (None, 16, 16, 512)   1180160     leaky_re_lu_3[0][0]              
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 16, 16, 512)   2048        unet_conv2D_4[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 16, 16, 512)   0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
unet_conv2D_5 (Conv2D)           (None, 8, 8, 512)     2359808     leaky_re_lu_4[0][0]              
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 8, 8, 512)     2048        unet_conv2D_5[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 8, 8, 512)     0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
unet_conv2D_6 (Conv2D)           (None, 4, 4, 512)     2359808     leaky_re_lu_5[0][0]              
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 4, 4, 512)     2048        unet_conv2D_6[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 4, 4, 512)     0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
unet_conv2D_7 (Conv2D)           (None, 2, 2, 512)     2359808     leaky_re_lu_6[0][0]              
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 2, 2, 512)     2048        unet_conv2D_7[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 2, 2, 512)     0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
unet_conv2D_8 (Conv2D)           (None, 1, 1, 512)     2359808     leaky_re_lu_7[0][0]              
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 1, 1, 512)     2048        unet_conv2D_8[0][0]              
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 1, 1, 512)     0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 2, 2, 512)     0           activation_1[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_1 (Conv2D)         (None, 2, 2, 512)     2359808     up_sampling2d_1[0][0]            
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 2, 2, 512)     2048        unet_upconv2D_1[0][0]            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 2, 2, 512)     0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 2, 2, 1024)    0           dropout_1[0][0]                  
                                                                   batch_normalization_6[0][0]      
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 2, 2, 1024)    0           concatenate_1[0][0]              
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 4, 4, 1024)    0           activation_2[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_2 (Conv2D)         (None, 4, 4, 512)     4719104     up_sampling2d_2[0][0]            
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 4, 4, 512)     2048        unet_upconv2D_2[0][0]            
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 4, 4, 512)     0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 4, 4, 1024)    0           dropout_2[0][0]                  
                                                                   batch_normalization_5[0][0]      
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 4, 4, 1024)    0           concatenate_2[0][0]              
____________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)   (None, 8, 8, 1024)    0           activation_3[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_3 (Conv2D)         (None, 8, 8, 512)     4719104     up_sampling2d_3[0][0]            
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 8, 8, 512)     2048        unet_upconv2D_3[0][0]            
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 8, 8, 512)     0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
concatenate_3 (Concatenate)      (None, 8, 8, 1024)    0           dropout_3[0][0]                  
                                                                   batch_normalization_4[0][0]      
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 8, 8, 1024)    0           concatenate_3[0][0]              
____________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)   (None, 16, 16, 1024)  0           activation_4[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_4 (Conv2D)         (None, 16, 16, 256)   2359552     up_sampling2d_4[0][0]            
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 16, 16, 256)   1024        unet_upconv2D_4[0][0]            
____________________________________________________________________________________________________
concatenate_4 (Concatenate)      (None, 16, 16, 768)   0           batch_normalization_11[0][0]     
                                                                   batch_normalization_3[0][0]      
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 16, 16, 768)   0           concatenate_4[0][0]              
____________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)   (None, 32, 32, 768)   0           activation_5[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_5 (Conv2D)         (None, 32, 32, 128)   884864      up_sampling2d_5[0][0]            
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 32, 32, 128)   512         unet_upconv2D_5[0][0]            
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 32, 32, 384)   0           batch_normalization_12[0][0]     
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 32, 32, 384)   0           concatenate_5[0][0]              
____________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)   (None, 64, 64, 384)   0           activation_6[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_6 (Conv2D)         (None, 64, 64, 64)    221248      up_sampling2d_6[0][0]            
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 64, 64, 64)    256         unet_upconv2D_6[0][0]            
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 64, 64, 192)   0           batch_normalization_13[0][0]     
                                                                   batch_normalization_1[0][0]      
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 64, 64, 192)   0           concatenate_6[0][0]              
____________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)   (None, 128, 128, 192) 0           activation_7[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_7 (Conv2D)         (None, 128, 128, 64)  110656      up_sampling2d_7[0][0]            
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 128, 128, 64)  256         unet_upconv2D_7[0][0]            
____________________________________________________________________________________________________
concatenate_7 (Concatenate)      (None, 128, 128, 128) 0           batch_normalization_14[0][0]     
                                                                   unet_conv2D_1[0][0]              
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 128, 128, 128) 0           concatenate_7[0][0]              
____________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)   (None, 256, 256, 128) 0           activation_8[0][0]               
____________________________________________________________________________________________________
last_conv (Conv2D)               (None, 256, 256, 3)   3459        up_sampling2d_8[0][0]            
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 256, 256, 3)   0           last_conv[0][0]                  
====================================================================================================
Total params: 26,387,971
Trainable params: 26,377,987
Non-trainable params: 9,984
____________________________________________________________________________________________________
PatchGAN summary
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
discriminator_input (InputLa (None, 64, 64, 3)         0         
_________________________________________________________________
disc_conv2d_1 (Conv2D)       (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization_15 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 32, 32, 64)        0         
_________________________________________________________________
disc_conv2d_2 (Conv2D)       (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_16 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 16, 16, 128)       0         
_________________________________________________________________
disc_conv2d_3 (Conv2D)       (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_17 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
disc_conv2d_4 (Conv2D)       (None, 4, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_18 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
disc_conv2d_5 (Conv2D)       (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_19 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 2, 2, 512)         0         
_________________________________________________________________
disc_conv2d_6 (Conv2D)       (None, 1, 1, 512)         2359808   
_________________________________________________________________
batch_normalization_20 (Batc (None, 1, 1, 512)         2048      
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
disc_dense (Dense)           (None, 2)                 1026      
=================================================================
Total params: 6,279,554
Trainable params: 6,275,586
Non-trainable params: 3,968
_________________________________________________________________
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
disc_input_0 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_1 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_2 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_3 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_4 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_5 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_6 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_7 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_8 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_9 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_10 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_11 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_12 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_13 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_14 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_15 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
PatchGAN (Model)                 [(None, 2), (None, 51 6279554     disc_input_0[0][0]               
                                                                   disc_input_1[0][0]               
                                                                   disc_input_2[0][0]               
                                                                   disc_input_3[0][0]               
                                                                   disc_input_4[0][0]               
                                                                   disc_input_5[0][0]               
                                                                   disc_input_6[0][0]               
                                                                   disc_input_7[0][0]               
                                                                   disc_input_8[0][0]               
                                                                   disc_input_9[0][0]               
                                                                   disc_input_10[0][0]              
                                                                   disc_input_11[0][0]              
                                                                   disc_input_12[0][0]              
                                                                   disc_input_13[0][0]              
                                                                   disc_input_14[0][0]              
                                                                   disc_input_15[0][0]              
____________________________________________________________________________________________________
concatenate_8 (Concatenate)      (None, 32)            0           PatchGAN[17][0]                  
                                                                   PatchGAN[18][0]                  
                                                                   PatchGAN[19][0]                  
                                                                   PatchGAN[20][0]                  
                                                                   PatchGAN[21][0]                  
                                                                   PatchGAN[22][0]                  
                                                                   PatchGAN[23][0]                  
                                                                   PatchGAN[24][0]                  
                                                                   PatchGAN[25][0]                  
                                                                   PatchGAN[26][0]                  
                                                                   PatchGAN[27][0]                  
                                                                   PatchGAN[28][0]                  
                                                                   PatchGAN[29][0]                  
                                                                   PatchGAN[30][0]                  
                                                                   PatchGAN[31][0]                  
                                                                   PatchGAN[32][0]                  
____________________________________________________________________________________________________
disc_output (Dense)              (None, 2)             66          concatenate_8[0][0]              
====================================================================================================
Total params: 6,279,620
Trainable params: 6,275,652
Non-trainable params: 3,968
____________________________________________________________________________________________________
Start training
  4/400 [..............................] - ETA: 4603s - D logloss: 2.2178 - G tot: 20.5461 - G L1: 1.8321 - G logloss: 2.2249  8/400 [..............................] - ETA: 2370s - D logloss: 1.1717 - G tot: 21.0685 - G L1: 1.8767 - G logloss: 2.3010 12/400 [..............................] - ETA: 1586s - D logloss: 1.4975 - G tot: 20.1968 - G L1: 1.7895 - G logloss: 2.3019 16/400 [>.............................] - ETA: 1195s - D logloss: 1.1543 - G tot: 19.6211 - G L1: 1.7305 - G logloss: 2.3161 20/400 [>.............................] - ETA: 959s - D logloss: 1.3443 - G tot: 18.9522 - G L1: 1.6677 - G logloss: 2.2748  24/400 [>.............................] - ETA: 803s - D logloss: 1.1428 - G tot: 18.3677 - G L1: 1.6063 - G logloss: 2.3052 28/400 [=>............................] - ETA: 690s - D logloss: 1.2959 - G tot: 18.0509 - G L1: 1.5796 - G logloss: 2.2544 32/400 [=>............................] - ETA: 606s - D logloss: 1.1564 - G tot: 17.8475 - G L1: 1.5570 - G logloss: 2.2774 36/400 [=>............................] - ETA: 539s - D logloss: 1.2615 - G tot: 17.8068 - G L1: 1.5508 - G logloss: 2.2989 40/400 [==>...........................] - ETA: 487s - D logloss: 1.1469 - G tot: 17.4780 - G L1: 1.5228 - G logloss: 2.2503 44/400 [==>...........................] - ETA: 443s - D logloss: 1.2200 - G tot: 17.3497 - G L1: 1.5107 - G logloss: 2.2427 48/400 [==>...........................] - ETA: 407s - D logloss: 1.1322 - G tot: 17.3155 - G L1: 1.5094 - G logloss: 2.2218 52/400 [==>...........................] - ETA: 376s - D logloss: 1.2182 - G tot: 17.1636 - G L1: 1.4944 - G logloss: 2.2200 56/400 [===>..........................] - ETA: 350s - D logloss: 1.1434 - G tot: 16.9975 - G L1: 1.4772 - G logloss: 2.2259 60/400 [===>..........................] - ETA: 327s - D logloss: 1.2072 - G tot: 16.8483 - G L1: 1.4639 - G logloss: 2.2090 64/400 [===>..........................] - ETA: 307s - D logloss: 1.1384 - G tot: 16.7164 - G L1: 1.4527 - G logloss: 2.1890 68/400 [====>.........................] - ETA: 288s - D logloss: 1.1755 - G tot: 16.6355 - G L1: 1.4438 - G logloss: 2.1971 72/400 [====>.........................] - ETA: 273s - D logloss: 1.1186 - G tot: 16.5369 - G L1: 1.4371 - G logloss: 2.1659 76/400 [====>.........................] - ETA: 258s - D logloss: 1.1569 - G tot: 16.3034 - G L1: 1.4163 - G logloss: 2.1403 80/400 [=====>........................] - ETA: 245s - D logloss: 1.1091 - G tot: 16.1711 - G L1: 1.4030 - G logloss: 2.1411 84/400 [=====>........................] - ETA: 233s - D logloss: 1.1455 - G tot: 16.0955 - G L1: 1.3968 - G logloss: 2.1274 88/400 [=====>........................] - ETA: 222s - D logloss: 1.1019 - G tot: 16.0765 - G L1: 1.3965 - G logloss: 2.1119 92/400 [=====>........................] - ETA: 212s - D logloss: 1.1311 - G tot: 16.0065 - G L1: 1.3909 - G logloss: 2.0973 96/400 [======>.......................] - ETA: 203s - D logloss: 1.0886 - G tot: 15.9074 - G L1: 1.3826 - G logloss: 2.0819100/400 [======>.......................] - ETA: 194s - D logloss: 1.1188 - G tot: 15.8226 - G L1: 1.3742 - G logloss: 2.0806104/400 [======>.......................] - ETA: 187s - D logloss: 1.0843 - G tot: 15.8207 - G L1: 1.3749 - G logloss: 2.0721108/400 [=======>......................] - ETA: 179s - D logloss: 1.1065 - G tot: 15.7428 - G L1: 1.3678 - G logloss: 2.0649112/400 [=======>......................] - ETA: 172s - D logloss: 1.0777 - G tot: 15.6672 - G L1: 1.3607 - G logloss: 2.0606116/400 [=======>......................] - ETA: 166s - D logloss: 1.0933 - G tot: 15.5905 - G L1: 1.3538 - G logloss: 2.0526120/400 [========>.....................] - ETA: 160s - D logloss: 1.0645 - G tot: 15.4890 - G L1: 1.3444 - G logloss: 2.0447124/400 [========>.....................] - ETA: 154s - D logloss: 1.0894 - G tot: 15.3697 - G L1: 1.3336 - G logloss: 2.0342128/400 [========>.....................] - ETA: 148s - D logloss: 1.0613 - G tot: 15.3836 - G L1: 1.3361 - G logloss: 2.0224132/400 [========>.....................] - ETA: 143s - D logloss: 1.0824 - G tot: 15.3586 - G L1: 1.3337 - G logloss: 2.0212136/400 [=========>....................] - ETA: 138s - D logloss: 1.0563 - G tot: 15.3269 - G L1: 1.3314 - G logloss: 2.0125140/400 [=========>....................] - ETA: 134s - D logloss: 1.0828 - G tot: 15.2419 - G L1: 1.3246 - G logloss: 1.9961144/400 [=========>....................] - ETA: 129s - D logloss: 1.0592 - G tot: 15.1897 - G L1: 1.3203 - G logloss: 1.9867148/400 [==========>...................] - ETA: 125s - D logloss: 1.0760 - G tot: 15.1411 - G L1: 1.3161 - G logloss: 1.9805152/400 [==========>...................] - ETA: 121s - D logloss: 1.0554 - G tot: 15.0775 - G L1: 1.3105 - G logloss: 1.9721156/400 [==========>...................] - ETA: 117s - D logloss: 1.0744 - G tot: 15.0034 - G L1: 1.3042 - G logloss: 1.9616160/400 [===========>..................] - ETA: 113s - D logloss: 1.0557 - G tot: 15.0263 - G L1: 1.3069 - G logloss: 1.9570164/400 [===========>..................] - ETA: 110s - D logloss: 1.0682 - G tot: 15.0004 - G L1: 1.3054 - G logloss: 1.9459168/400 [===========>..................] - ETA: 106s - D logloss: 1.0502 - G tot: 14.9525 - G L1: 1.3018 - G logloss: 1.9343172/400 [===========>..................] - ETA: 103s - D logloss: 1.0633 - G tot: 14.8966 - G L1: 1.2971 - G logloss: 1.9257176/400 [============>.................] - ETA: 100s - D logloss: 1.0463 - G tot: 14.8516 - G L1: 1.2932 - G logloss: 1.9192180/400 [============>.................] - ETA: 97s - D logloss: 1.0581 - G tot: 14.8492 - G L1: 1.2937 - G logloss: 1.9123 184/400 [============>.................] - ETA: 94s - D logloss: 1.0431 - G tot: 14.8169 - G L1: 1.2916 - G logloss: 1.9010188/400 [=============>................] - ETA: 91s - D logloss: 1.0555 - G tot: 14.7693 - G L1: 1.2878 - G logloss: 1.8916192/400 [=============>................] - ETA: 88s - D logloss: 1.0422 - G tot: 14.7690 - G L1: 1.2885 - G logloss: 1.8843196/400 [=============>................] - ETA: 85s - D logloss: 1.0554 - G tot: 14.7205 - G L1: 1.2846 - G logloss: 1.8745