____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
unet_input (InputLayer)          (None, 256, 256, 3)   0                                            
____________________________________________________________________________________________________
unet_conv2D_1 (Conv2D)           (None, 128, 128, 64)  1792        unet_input[0][0]                 
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 128, 128, 64)  0           unet_conv2D_1[0][0]              
____________________________________________________________________________________________________
unet_conv2D_2 (Conv2D)           (None, 64, 64, 128)   73856       leaky_re_lu_1[0][0]              
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 64, 64, 128)   512         unet_conv2D_2[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 64, 64, 128)   0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
unet_conv2D_3 (Conv2D)           (None, 32, 32, 256)   295168      leaky_re_lu_2[0][0]              
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 32, 32, 256)   1024        unet_conv2D_3[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 32, 32, 256)   0           batch_normalization_2[0][0]      
____________________________________________________________________________________________________
unet_conv2D_4 (Conv2D)           (None, 16, 16, 512)   1180160     leaky_re_lu_3[0][0]              
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 16, 16, 512)   2048        unet_conv2D_4[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 16, 16, 512)   0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
unet_conv2D_5 (Conv2D)           (None, 8, 8, 512)     2359808     leaky_re_lu_4[0][0]              
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 8, 8, 512)     2048        unet_conv2D_5[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 8, 8, 512)     0           batch_normalization_4[0][0]      
____________________________________________________________________________________________________
unet_conv2D_6 (Conv2D)           (None, 4, 4, 512)     2359808     leaky_re_lu_5[0][0]              
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 4, 4, 512)     2048        unet_conv2D_6[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 4, 4, 512)     0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
unet_conv2D_7 (Conv2D)           (None, 2, 2, 512)     2359808     leaky_re_lu_6[0][0]              
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 2, 2, 512)     2048        unet_conv2D_7[0][0]              
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 2, 2, 512)     0           batch_normalization_6[0][0]      
____________________________________________________________________________________________________
unet_conv2D_8 (Conv2D)           (None, 1, 1, 512)     2359808     leaky_re_lu_7[0][0]              
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 1, 1, 512)     2048        unet_conv2D_8[0][0]              
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 1, 1, 512)     0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)   (None, 2, 2, 512)     0           activation_1[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_1 (Conv2D)         (None, 2, 2, 512)     2359808     up_sampling2d_1[0][0]            
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 2, 2, 512)     2048        unet_upconv2D_1[0][0]            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 2, 2, 512)     0           batch_normalization_8[0][0]      
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 2, 2, 1024)    0           dropout_1[0][0]                  
                                                                   batch_normalization_6[0][0]      
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 2, 2, 1024)    0           concatenate_1[0][0]              
____________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)   (None, 4, 4, 1024)    0           activation_2[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_2 (Conv2D)         (None, 4, 4, 512)     4719104     up_sampling2d_2[0][0]            
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 4, 4, 512)     2048        unet_upconv2D_2[0][0]            
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 4, 4, 512)     0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 4, 4, 1024)    0           dropout_2[0][0]                  
                                                                   batch_normalization_5[0][0]      
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 4, 4, 1024)    0           concatenate_2[0][0]              
____________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)   (None, 8, 8, 1024)    0           activation_3[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_3 (Conv2D)         (None, 8, 8, 512)     4719104     up_sampling2d_3[0][0]            
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 8, 8, 512)     2048        unet_upconv2D_3[0][0]            
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 8, 8, 512)     0           batch_normalization_10[0][0]     
____________________________________________________________________________________________________
concatenate_3 (Concatenate)      (None, 8, 8, 1024)    0           dropout_3[0][0]                  
                                                                   batch_normalization_4[0][0]      
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 8, 8, 1024)    0           concatenate_3[0][0]              
____________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)   (None, 16, 16, 1024)  0           activation_4[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_4 (Conv2D)         (None, 16, 16, 256)   2359552     up_sampling2d_4[0][0]            
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 16, 16, 256)   1024        unet_upconv2D_4[0][0]            
____________________________________________________________________________________________________
concatenate_4 (Concatenate)      (None, 16, 16, 768)   0           batch_normalization_11[0][0]     
                                                                   batch_normalization_3[0][0]      
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 16, 16, 768)   0           concatenate_4[0][0]              
____________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)   (None, 32, 32, 768)   0           activation_5[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_5 (Conv2D)         (None, 32, 32, 128)   884864      up_sampling2d_5[0][0]            
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 32, 32, 128)   512         unet_upconv2D_5[0][0]            
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 32, 32, 384)   0           batch_normalization_12[0][0]     
                                                                   batch_normalization_2[0][0]      
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 32, 32, 384)   0           concatenate_5[0][0]              
____________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)   (None, 64, 64, 384)   0           activation_6[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_6 (Conv2D)         (None, 64, 64, 64)    221248      up_sampling2d_6[0][0]            
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 64, 64, 64)    256         unet_upconv2D_6[0][0]            
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 64, 64, 192)   0           batch_normalization_13[0][0]     
                                                                   batch_normalization_1[0][0]      
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 64, 64, 192)   0           concatenate_6[0][0]              
____________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)   (None, 128, 128, 192) 0           activation_7[0][0]               
____________________________________________________________________________________________________
unet_upconv2D_7 (Conv2D)         (None, 128, 128, 64)  110656      up_sampling2d_7[0][0]            
____________________________________________________________________________________________________
batch_normalization_14 (BatchNor (None, 128, 128, 64)  256         unet_upconv2D_7[0][0]            
____________________________________________________________________________________________________
concatenate_7 (Concatenate)      (None, 128, 128, 128) 0           batch_normalization_14[0][0]     
                                                                   unet_conv2D_1[0][0]              
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 128, 128, 128) 0           concatenate_7[0][0]              
____________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)   (None, 256, 256, 128) 0           activation_8[0][0]               
____________________________________________________________________________________________________
last_conv (Conv2D)               (None, 256, 256, 3)   3459        up_sampling2d_8[0][0]            
____________________________________________________________________________________________________
activation_9 (Activation)        (None, 256, 256, 3)   0           last_conv[0][0]                  
====================================================================================================
Total params: 26,387,971
Trainable params: 26,377,987
Non-trainable params: 9,984
____________________________________________________________________________________________________
PatchGAN summary
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
discriminator_input (InputLa (None, 64, 64, 3)         0         
_________________________________________________________________
disc_conv2d_1 (Conv2D)       (None, 32, 32, 64)        1792      
_________________________________________________________________
batch_normalization_15 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, 32, 32, 64)        0         
_________________________________________________________________
disc_conv2d_2 (Conv2D)       (None, 16, 16, 128)       73856     
_________________________________________________________________
batch_normalization_16 (Batc (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_re_lu_9 (LeakyReLU)    (None, 16, 16, 128)       0         
_________________________________________________________________
disc_conv2d_3 (Conv2D)       (None, 8, 8, 256)         295168    
_________________________________________________________________
batch_normalization_17 (Batc (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_re_lu_10 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
disc_conv2d_4 (Conv2D)       (None, 4, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_18 (Batc (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_re_lu_11 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
disc_conv2d_5 (Conv2D)       (None, 2, 2, 512)         2359808   
_________________________________________________________________
batch_normalization_19 (Batc (None, 2, 2, 512)         2048      
_________________________________________________________________
leaky_re_lu_12 (LeakyReLU)   (None, 2, 2, 512)         0         
_________________________________________________________________
disc_conv2d_6 (Conv2D)       (None, 1, 1, 512)         2359808   
_________________________________________________________________
batch_normalization_20 (Batc (None, 1, 1, 512)         2048      
_________________________________________________________________
leaky_re_lu_13 (LeakyReLU)   (None, 1, 1, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 512)               0         
_________________________________________________________________
disc_dense (Dense)           (None, 2)                 1026      
=================================================================
Total params: 6,279,554
Trainable params: 6,275,586
Non-trainable params: 3,968
_________________________________________________________________
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
disc_input_0 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_1 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_2 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_3 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_4 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_5 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_6 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_7 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_8 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_9 (InputLayer)        (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_10 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_11 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_12 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_13 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_14 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
disc_input_15 (InputLayer)       (None, 64, 64, 3)     0                                            
____________________________________________________________________________________________________
PatchGAN (Model)                 [(None, 2), (None, 51 6279554     disc_input_0[0][0]               
                                                                   disc_input_1[0][0]               
                                                                   disc_input_2[0][0]               
                                                                   disc_input_3[0][0]               
                                                                   disc_input_4[0][0]               
                                                                   disc_input_5[0][0]               
                                                                   disc_input_6[0][0]               
                                                                   disc_input_7[0][0]               
                                                                   disc_input_8[0][0]               
                                                                   disc_input_9[0][0]               
                                                                   disc_input_10[0][0]              
                                                                   disc_input_11[0][0]              
                                                                   disc_input_12[0][0]              
                                                                   disc_input_13[0][0]              
                                                                   disc_input_14[0][0]              
                                                                   disc_input_15[0][0]              
____________________________________________________________________________________________________
concatenate_8 (Concatenate)      (None, 32)            0           PatchGAN[17][0]                  
                                                                   PatchGAN[18][0]                  
                                                                   PatchGAN[19][0]                  
                                                                   PatchGAN[20][0]                  
                                                                   PatchGAN[21][0]                  
                                                                   PatchGAN[22][0]                  
                                                                   PatchGAN[23][0]                  
                                                                   PatchGAN[24][0]                  
                                                                   PatchGAN[25][0]                  
                                                                   PatchGAN[26][0]                  
                                                                   PatchGAN[27][0]                  
                                                                   PatchGAN[28][0]                  
                                                                   PatchGAN[29][0]                  
                                                                   PatchGAN[30][0]                  
                                                                   PatchGAN[31][0]                  
                                                                   PatchGAN[32][0]                  
____________________________________________________________________________________________________
disc_output (Dense)              (None, 2)             66          concatenate_8[0][0]              
==================================================